---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeKey.#ctor(System.String)
source: html/e263790a-1916-a347-f0ea-65fd04d93077.htm
---
# Autodesk.Revit.DB.ExportLinetypeKey.#ctor Method

Constructs a new default ExportLinetypeKey using the original line type name as input.

## Syntax (C#)
```csharp
public ExportLinetypeKey(
	string originalLinetypeName
)
```

## Parameters
- **originalLinetypeName** (`System.String`) - The original line type name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null